tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minacle/chntpw"
tap "sidneys/homebrew"
brew "ca-certificates"
brew "gettext"
brew "openssl@3"
brew "libunistring"
brew "libidn2"
brew "libnghttp2"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "agda"
brew "brotli"
brew "giflib"
brew "highway"
brew "imath"
brew "jpeg-turbo"
brew "libpng"
brew "lz4"
brew "xz"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "openexr"
brew "webp"
brew "jpeg-xl"
brew "libvmaf"
brew "aom"
brew "aria2"
brew "gcc"
brew "open-mpi"
brew "m4"
brew "autoconf"
brew "automake"
brew "boost"
brew "c-ares"
brew "cabextract"
brew "freetype"
brew "fontconfig"
brew "mpdecimal"
brew "pcre2"
brew "glib"
brew "xorgproto"
brew "libxau"
brew "libxdmcp"
brew "libxcb"
brew "libx11"
brew "libxext"
brew "libxrender"
brew "lzo"
brew "pixman"
brew "python@3.12"
brew "cairo"
brew "cdrtools"
brew "fribidi"
brew "graphite2"
brew "harfbuzz"
brew "libmicrohttpd"
brew "libsodium"
brew "pango"
brew "tesseract"
brew "zeromq"
brew "ffmpeg"
brew "chromaprint"
brew "cmake"
brew "deno"
brew "ghostscript"
brew "libavif"
brew "gd"
brew "gdbm"
brew "geckodriver"
brew "ghq"
brew "git"
brew "glpk"
brew "gnupg@1.4"
brew "lua"
brew "qt"
brew "gnuplot"
brew "go"
brew "gradle"
brew "libheif"
brew "graphicsmagick"
brew "pkgconf"
brew "hdf5"
brew "hugo"
brew "libraw"
brew "imagemagick"
brew "iperf3"
brew "libexif"
brew "libffi"
brew "libpthread-stubs"
brew "libuv"
brew "libyaml"
brew "lima"
brew "llvm"
brew "luarocks"
brew "mercurial"
brew "mono-libgdiplus"
brew "neovim"
brew "ninja"
brew "nkf"
brew "node"
brew "portaudio"
brew "pyqt"
brew "qscintilla2"
brew "suite-sparse"
brew "sundials"
brew "octave"
brew "openjdk@17"
brew "pandoc"
brew "php@8.2", restart_service: true
brew "pipx"
brew "pyenv"
brew "python@3.10"
brew "python@3.11"
brew "python@3.9"
brew "qemu"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "stow"
brew "swi-prolog"
brew "utf8proc"
brew "tmux"
brew "tree"
brew "wget"
brew "wimlib"
brew "winetricks"
brew "xterm"
cask "blackhole-16ch"
cask "blackhole-2ch"
cask "firefox"
cask "font-hack-nerd-font"
cask "gstreamer-runtime"
cask "iterm2"
cask "kegworks"
cask "logisim-evolution"
cask "mactex-no-gui"
cask "opera"
cask "skim"
cask "wine-stable"
