tap "felixkratz/formulae", trusted: true
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Asynchronous DNS library
brew "c-ares"
# C string library for manipulating Unicode strings
brew "libunistring"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Collection of portable C++ source libraries
brew "boost"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# HTTP/2 C Library
brew "libnghttp2"
# Library and utilities for processing GIFs
brew "giflib"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# NaCl networking and cryptography library
brew "libsodium"
# Dependency Manager for PHP
brew "composer"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Command-line utilities for working with desktop entries
brew "desktop-file-utils"
# YAML Parser
brew "libyaml"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Multi-format archive and compression library
brew "libarchive"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Library for Linear and Mixed-Integer Programming
brew "glpk"
# GNU Privacy Guard (OpenPGP)
brew "gnupg@1.4"
# Powerful, lightweight programming language
brew "lua"
# Command-driven, interactive function plotting
brew "gnuplot"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image processing tools collection
brew "graphicsmagick"
# Cross-platform program for developing Haskell projects
brew "haskell-stack"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# EXIF parsing library
brew "libexif"
# Portable Foreign Function Interface library
brew "libffi"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# LLVM's OpenMP runtime library
brew "libomp"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Next-gen compiler infrastructure
brew "llvm"
# Package manager for the Lua programming language
brew "luarocks"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# High performance message passing library
brew "open-mpi"
# Development kit for the Java programming language
brew "openjdk@21", link: true
# Swiss-army knife of markup format conversion
brew "pandoc"
# General-purpose scripting language
brew "php@8.2", restart_service: :changed
# Cross-platform library for audio I/O
brew "portaudio"
# Python bindings for v6 of Qt
brew "pyqt"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Parser generator tool
brew "tree-sitter-cli"
# Markup-based typesetting system
brew "typst"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Access X11 clipboards from the command-line
brew "xclip"
# Terminal emulator for the X Window System
brew "xterm"
# High-performance, asynchronous messaging library
brew "zeromq"
# Flexible and fast Zsh plugin manager
brew "zinit"
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# Application uninstaller
cask "appcleaner"
# Records audio from any application
cask "audio-hijack"
# Japanese input method
cask "azookey"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
cask "font-annotation-mono"
cask "font-hack-nerd-font"
cask "font-hackgen"
cask "font-monaspace"
# Customise mouse behavior
cask "linearmouse"
# SKK Input Method
cask "macskk"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Web browser
cask "opera"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
npm "@mermaid-js/mermaid-cli"
